#!/usr/bin/ruby

# Homebrew global params and taps
cask_args appdir: '/Applications'
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'caskroom/fonts'
tap 'koekeishiya/formulae'

# Cask Applications (preferred)
cask 'iterm2'
cask 'sketch'
cask 'spectacle'
cask 'spotify'
cask 'the-unarchiver'
cask 'tower'
cask 'visual-studio-code'

# Devtools
brew 'hub'
brew 'nvm'
brew 'yarn', args: ['without-node']
brew 'python3'
brew 'rbenv'

# ZSH extensions
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'
brew 'zsh-completions'

# Fonts
cask 'font-fira-code'
cask 'font-roboto'
